# ActualLightingLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..ActualLightingLoad Property
Space Class See Also
---
Get the Actual Lighting Load of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double ActualLightingLoad { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActualLightingLoad As Double
	Get
```

Visual C++
---
```text
public:
property double ActualLightingLoad {
	double get ();
}
```

# Remarks
This property is used to get the Actual Lighting Load of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace